openfoam/system/topoSetZonesToSets
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(



    {
        name c0;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    c0;
    }

    {
        name c1;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    c1;
    }
/*    
    {
        name c2;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    c2;
    }
*/

);

// ************************************************************************* //
